/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3 */

/*Console.WriteLine ("input the first number: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("input the second number: ");
int secondNumber = Convert.ToInt32(Console.ReadLine());
if (firstNumber > secondNumber)
{
   Console.WriteLine($"First Number {firstNumber} is MAX, Second Number {secondNumber} is MIN");
}
else 
{
   Console.WriteLine($"First Number {firstNumber} is MIN, Second Number {secondNumber} is MAX");
} */

/* Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22 */

/*Console.WriteLine ("Input the first number: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine ("Input the second number: ");
int secondNumber = Convert.ToInt32(Console.ReadLine());
Console.WriteLine ("Input the third number: ");
int thirdNumber = Convert.ToInt32(Console.ReadLine());
int maxim = firstNumber;
if (secondNumber >  firstNumber)
{

    if (thirdNumber>firstNumber)
    {
        maxim = thirdNumber;
    }
    else 
    {
        maxim = secondNumber;
    }
}
else {
    if ( thirdNumber>firstNumber)
    {
        maxim = thirdNumber;
    }
}
Console.WriteLine($"Max number is {maxim}"); */

/* Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет */

/* Console.WriteLine("input natural number: ");
int number = Convert.ToInt32(Console.ReadLine());
if (number %2 == 0)
{
    Console.WriteLine($"Number {number} is even number.");
}
else{
    Console.WriteLine($"Number {number} is uneven number.");
} */


/* Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8  */

/* Console.WriteLine("Input natural digital");
int n = Convert.ToInt32(Console.ReadLine());
int current = 2;
while(current<n)
{
    if (current%2 ==0)
    {    Console.Write($"{current}, ");
    }
    current++;
}*/






